modify readme files
